{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faBD:/STUDY/Udacity/Nanodegree/SDC-ND/P3-Behaviour-Cloning/model_n.py\u00da\b<lambda>1\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [40, 160, 3], "name": "lambda_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 16, "input_dtype": "float32", "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 40, 160, 3], "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 8, "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 4, "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 2, "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 16, "input_dim": 2432, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 16, "input_dim": 16, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 16, "input_dim": 16, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "input_dim": 16, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.1"}